src/app_ruby/app/controllers/users_controller.rb

def create_xml
  @user = User.new(params[:user])
  @user.save!
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `last_name`, `remember_token`, `login`, `email`, `first_name`) VALUES('', '554337f8bc4e71a711b25ac897d759bfce87067d', '2010-03-28 08:59:51', '988b32816f429d39d958ed7f4afa704f7ceed1d9', NULL, '2010-03-28 08:59:51', 'qq', NULL, 'tester', 'test@tes.pl', 'qqq')

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `last_name`, `remember_token`, `login`, `email`, `first_name`) VALUES('', 'c6a9b6ab12587a89fb5e9019cb4c540043d88f52', '2010-03-27 13:16:19', '81b1737251492be9a1b1bfa66e4f09914dffadc8', NULL, '2010-03-27 13:16:19', NULL, NULL, 'stepu', 'stepu@tlen.pl', NULL)